
&НаКлиенте
Процедура КомандаПоиск(Команда)
	КомандаПоискНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаПоискНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Миллезимы.Регион КАК Регион,
	               |	Миллезимы.Год КАК Год,
	               |	Миллезимы.Критик КАК Критик,
	               |	Миллезимы.Оценка КАК Оценка
	               |ИЗ
	               |	РегистрСведений.Миллезимы КАК Миллезимы";
	ТребуетсяГде = Истина;
	Если НЕ Регион.Пустая() Тогда
		Запрос.Текст = Запрос.Текст + " 					   
	               |ГДЕ
	               |	Миллезимы.Регион В ИЕРАРХИИ(&Регион)";
		Запрос.УстановитьПараметр("Регион", Регион);
		ТребуетсяГде = Ложь;
	КонецЕсли;
	
	Если НЕ Год.Пустая() Тогда
		Если ТребуетсяГде Тогда
			Запрос.Текст = Запрос.Текст + " ГДЕ ";
		Иначе
			Запрос.Текст = Запрос.Текст + " И ";
		КонецЕсли;
	    Запрос.Текст = Запрос.Текст + "Миллезимы.Год = &Год";
		Запрос.УстановитьПараметр("Год", Год);
	КонецЕсли;
	
    Запрос.Текст = Запрос.Текст + "
               |УПОРЯДОЧИТЬ ПО
               |	Регион,
               |	Год,
               |	Критик";
			   
			   
	ТЗ.Очистить();
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		З = ТЗ.Добавить();
		З.Регион = Выборка.Регион;
		З.Год = Выборка.Год;
		З.Критик = Выборка.Критик;
		З.Оценка = Выборка.Оценка;
	КонецЦикла
		
КонецПроцедуры
