
// Генерация движений по документу
// 
// Параметры:
// 	Отказ - Булево - прерывание процесса проведения
// 	РежимПроведения - DocumentPostingMode - режим проведения документа (Оперативный, неоперативный)
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	НЗ = Движения.СостояниеПогреба;
	НЗ.Записывать = Истина;
	Для каждого Вино Из Вина Цикл
		З = НЗ.Добавить();
		З.Период = Дата;
		З.ВидДвижения = ВидДвиженияНакопления.Приход;
		З.Вино = Вино.Вино;
		З.Погреб = Погреб;
		З.Количество = Вино.Количество;
		З.Цена = Вино.Цена;
	КонецЦикла;
КонецПроцедуры



